/*
ДОМАШНЕЕ ЗАДАНИЕ #9
---------------------------------------------------------
Консольный интернет-магазин.
Создать класс Product(родитель).
Три наследника класса Product(любые три товара).
Класс Store(у него массивы этих товаров).
Реализовать выбор категории товара.
Потом Выбор определенной модели.
Потом отображение детальной инфо о выбранной моделе.

*Возможность вернуться в предыдущее меню
**Корзина

1.Холодильнки
2.Телвизоры...
0.Выход

1

1.Samsung GL-351 8000
2.Samsung GL-3512 10000
0.Назад

1

полное описание данного товара
1.добавить в корзину
0.вернуться в предыдущее меню

Перцух Алексей, учебная группа JAVA A01 "ШАГ", Запорожье 2021
*/

public class Main {

    public static void main(String[] args) {
	// write your code here
        Store store = new Store();
        store.go();
    }
}
